markets = [
    (1, 'Пятерочка', 'ул. Гастелло, 4/1, Мондштат, Ростовская обл. 346880', '88005555505'),
    (2, 'Магнит', 'ул. Гастелло, 16, Батайск, Ростовская обл., 346887', '88002009002'),
    (3, 'Fix Price', 'ул. Гастелло, 1/147, Батайск, Ростовская обл., 346894', '88007753515'),
    (4, 'Магнит', 'ул. Луначарского, 188, Батайск, Ростовская обл., 346892', '88002009002'),
    (5, 'Владимировский магазин', 'ул. Клары Цеткин, 41, Батайск, Ростовская обл., 346894', '88005353535'),
    (6, 'Магнит Косметик', 'ул. Куйбышева, 164Б, Батайск, Ростовская обл., 346892', '88002009002'),
    (7, 'Пятерочка', 'пл., ул. Ленина, 5, Батайск, Ростовская обл., 346880', '88635474511'),
    (8, 'Снежок', 'ул. Кирова, 51литЧ, Батайск, Ростовская обл., 346880', '88635459031'),
    (9, 'Fix price', 'Рабочая ул., 102, Батайск, Ростовская обл., 346880', '85432342455'),
    (10, 'Магнит Косметик', 'ул. Гастелло, 16, Батайск, Ростовская обл., 246887', '89281952222')
]

items = [
    (1, 'Большой папа', 'Мороженое', 'г.'),
    (2, 'Ostro', 'Нож', 'г.'),
    (3, 'Coca-cola', 'Газировка', 'л.'),
    (4, 'Pepsi', 'Газировка', 'л.'),
    (5, 'Lipton в пакетике', 'Чай', 'г.'),
    (6, 'Parlament', 'Сигареты', 'г.'),
    (7, 'Данисимо', 'Творожок', 'г.'),
    (8, 'Lipton', 'Холодный чай', 'л.'),
    (9, 'Lays', 'Кортофельные чипсы', 'г.'),
    (10, 'Alpen Gold', 'Шоколад', 'г.')
]

shop_applications = [
    (1, 2, '2023.04.20'),
    (2, 3, '2023.04.15'),
    (3, 5, '2023.04.05'),
    (4, 10, '2023.04.02'),
    (5, 1, '2023.03.18'),
    (6, 9, '2023.03.10'),
    (7, 8, '2022.03.01'),
    (8, 4, '2022.02.28'),
    (9, 7, '2022.02.20'),
    (10, 6, '2022.02.15')
]

items_num = [
    (1, 5, 0),
    (2, 7, 25),
    (3, 2, 0),
    (4, 10, 25),
    (5, 4, 15),
    (6, 1, 20),
    (7, 8, 35),
    (8, 3, 0),
    (9, 9, 15),
    (10, 6, 20)
]

composition = [
    (1, 2, 3, 0),
    (2, 10, 5, 8),
    (3, 9, 8, 12),
    (4, 5, 10, 10),
    (5, 7, 1, 0),
    (6, 1, 2, 9),
    (7, 3, 4, 12),
    (8, 4, 9, 0),
    (9, 6, 6, 10),
    (10, 8, 7, 14)
]